{
  "pages": {
    "home": "home",
    "about": "about",
    "news": "news",
    "events": "events"
  },
  "navigation": {
    "home": "Home",
    "about": "About",
    "news": "News",
    "events": "Events",
    "language": "Language"
  },
  "languages": {
    "en": "English",
    "mk": "Macedonian"
  },
  "news": {
    "latestUpdates": "Latest updates from the world of poultry science",
    "readMore": "Read more",
    "backToNews": "Back to News",
    "backToAllNews": "Back to all news",
    "noArticlesFound": "No articles found",
    "tryDifferentSearch": "Try a different search term or filter",
    "searchPlaceholder": "Search articles...",
    "allTopics": "All Topics",
    "featured": "Featured",
    "readFullArticle": "Read Full Article",
    "loadingArticle": "Loading article...",
    "articleNotFound": "Article not found",
    "tryAgainLater": "Please try again later or browse other articles",
    "shareArticle": "Share this article"
  },
  "about": {
    "generalInfo": {
      "title": "ABOUT THE ORGANIZATION"
    },
    "name": "WORLD POULTRY SCIENCE ASSOCIATION - MACEDONIAN BRANCH (WPSA - MACEDONIAN BRANCH)",
    "shortName": "WPSA",
    "goals": {
      "title": "Goals of the Association",
      "description": "The Association primarily focuses on the concept of economically acceptable and sustainable development and adapted concept for the protection, promotion, and development of poultry science and the poultry industry. The Association will promote all theoretical knowledge and practical experiences that help realize and advance the basic goals and tasks.",
      "points": {
        "advancement": "Promotion of advancement of knowledge in all aspects of poultry science and the poultry industry",
        "congresses": "Promotion of World Poultry Congresses, as well as local and regional meetings",
        "gatherings": "Organizing professional and scientific gatherings through lectures, public appearances, round tables, forums, and other appropriate means",
        "informing": "Informing the public about the activities of the Association through social networks and other methods",
        "projects": "Development and implementation of scientific national and international projects in the field of poultry",
        "dissemination": "Dissemination of knowledge in all branches of the poultry industry and facilitating the exchange of economic activities of the Association through organizing scientific meetings, seminars, and lectures, as well as publishing activities"
      }
    },
    "mission": {
      "title": "Mission and Vision",
      "visionLabel": "Vision",
      "missionLabel": "Mission",
      "vision": "The vision of the Citizens Association WORLD POULTRY SCIENCE ASSOCIATION - MACEDONIAN BRANCH Skopje is: to have a high national and international reputation and trust promoting the concept of one health",
      "mission": "The mission of the Citizens Association WORLD POULTRY SCIENCE ASSOCIATION - MACEDONIAN BRANCH Skopje is: to facilitate the exchange of ideas, projects, and initiatives between science, education, and industry in poultry"
    },
    "images": {
      "chickenPortrait": "Poultry close-up"
    },
    "membership": {
      "title": "Membership",
      "description": "Membership in the association is voluntary. The membership in the Association can be:",
      "types": {
        "regular": {
          "title": "Regular",
          "description": "Any individual who is 18 years or older"
        },
        "student": {
          "title": "Student",
          "description": "Individuals enrolled in undergraduate, graduate or doctoral studies in the relevant scientific field. Student members do not pay membership fees"
        },
        "honorary": {
          "title": "Honorary",
          "description": "Individuals who have been selected by the Assembly of the Association for special merits, following a proposal by the President"
        },
        "associate": {
          "title": "Associate",
          "description": "Any legal entity that helps and supports the Association's operations"
        }
      },
      "fee": "Members pay membership fees (except student members) by April 30th each year. The amount of the membership fee is determined by the Assembly based on the President's proposal."
    },
    "leadership": {
      "title": "Leadership",
      "president": "President",
      "executiveBoard": "Executive Board"
    },
    "partners": {
      "title": "PARTNERS & RESOURCES",
      "description": "WPSA Macedonian Branch collaborates with numerous national and international organizations, educational institutions, and industry partners to advance poultry science in North Macedonia and beyond. Below are some of our key partners and resources."
    },
    "contact": {
      "title": "Contact Information",
      "address": "Address",
      "contact": "Contact",
      "addressLines": {
        "faculty": "Faculty of Veterinary Medicine",
        "street": "Lazar Pop Trajkov 5-7",
        "city": "1000 Skopje, North Macedonia"
      },
      "email": "Email",
      "phone": "Phone"
    },
    "join": {
      "title": "Join Us",
      "description": "We welcome new members who are interested in poultry science and the poultry industry. By joining WPSA Macedonian Branch, you'll gain access to a network of professionals, educational resources, and opportunities to collaborate on research projects.",
      "button": "Learn More About Membership"
    }
  }
}
