{
  "pages": {
    "home": "home",
    "about": "about",
    "news": "news",
    "events": "events"
  },
  "navigation": {
    "home": "Home",
    "about": "About",
    "news": "News",
    "events": "Events",
    "contact": "Contact us",
    "language": "Language"
  },
  "common": {
    "close": "Close",
    "copied": "Copied!",
    "copyLink": "Copy Link"
  },
  "languages": {
    "en": "English",
    "mk": "Macedonian"
  },
  "switchTo": "Switch to {{lang}}",
  "events": {
    "upcomingEvents": "Upcoming Events",
    "allEvents": "All Events",
    "filterAll": "All Events",
    "filterUpcoming": "Upcoming Events",
    "filterPast": "Past Events",
    "noEventsFound": "No events found",
    "tryDifferentFilter": "Try a different filter",
    "pastEvent": "Past Event",
    "eventsDescription": "Discover our seasonal activities and workshops dedicated to poultry science",
    "readMore": "Read More",
    "registerNow": "Register Now",
    "eventDetails": "Event Details",
    "location": "Location",
    "organizer": "Organizer",
    "eventDate": "Date",
    "eventTime": "Time",
    "contactInfo": "Contact Information",
    "joinEvent": "Join Event",
    "applyNow": "Apply Now",
    "loadingEvent": "Loading event details...",
    "learnMore": "Learn More",
    "errorLoading": "Error loading events. Please try again later."
  },
  "news": {
    "latestUpdates": "Latest updates from the world of poultry science",
    "readMore": "More",
    "backToNews": "Back to News",
    "backToAllNews": "Back to all news",
    "noArticlesFound": "No articles found",
    "tryDifferentSearch": "Try a different search term or filter",
    "searchPlaceholder": "Search articles...",
    "allTopics": "All Topics",
    "featured": "Featured News",
    "readFullArticle": "Read Full Article",
    "loadingArticle": "Loading article...",
    "articleNotFound": "Article not found",
    "tryAgainLater": "Please try again later or browse other articles",
    "shareArticle": "Share this article",
    "recentTitle": "Latest News",
    "recentDescription": "Stay updated with our latest news and developments",
    "viewAllNews": "View all news",
    "errorLoading": "Error loading news articles. Please try again later.",
    "filterByCategory": "Filter by category",
    "loadError": "Failed to load news articles"
  },
  "post": {
    "author": "Author",
    "published": "Published",
    "tags": "Tags",
    "loading": "Loading article...",
    "errorTitle": "Error Loading Article",
    "errorDefault": "An error occurred while loading the article.",
    "notFound": "Article not found",
    "loadError": "Failed to load article",
    "noIdProvided": "No article ID provided",
    "goBack": "Go Back",
    "backToNews": "Back to News"
  },
  "about": {
    "generalInfo": {
      "title": "ABOUT THE ORGANIZATION"
    },
    "nameFirstPart": "World Poultry Science Association -",
    "nameFirstPartNoDashes": "World Poultry Science Association",
    "nameSecondPart": "Macedonian Branch",
    "name": "WORLD POULTRY SCIENCE ASSOCIATION - MACEDONIAN BRANCH",
    "shortName": "WPSA",
    "nameWithoutDashes": "WORLD POULTRY SCIENCE ASSOCIATION MACEDONIAN BRANCH",
    "goals": {
      "title": "Goals of the Association",
      "description": "The Association primarily focuses on the concept of economically acceptable and sustainable development and adapted concept for the protection, promotion, and development of poultry science and the poultry industry. The Association will promote all theoretical knowledge and practical experiences that help realize and advance the basic goals and tasks.",
      "points": {
        "advancement": "Promotion of advancement of knowledge in all aspects of poultry science and the poultry industry",
        "congresses": "Promotion of World Poultry Congresses, as well as local and regional meetings",
        "gatherings": "Organizing professional and scientific gatherings through lectures, public appearances, round tables, forums, and other appropriate means",
        "informing": "Informing the public about the activities of the Association through social networks and other methods",
        "projects": "Development and implementation of scientific national and international projects in the field of poultry",
        "dissemination": "Dissemination of knowledge in all branches of the poultry industry and facilitating the exchange of economic activities of the Association through organizing scientific meetings, seminars, and lectures, as well as publishing activities"
      }
    },
    "mission": {
      "title": "Mission and Vision",
      "visionLabel": "Vision",
      "missionLabel": "Mission",
      "visionDeclaration": "The vision of the Citizens Association World Poultry Science Association - Macedonian Branch Skopje is:",
      "visionContent": "To have a high national and international reputation and trust promoting the concept of one health",
      "missionDeclaration": "The mission of the Citizens Association World Poultry Science Association - Macedonian Branch Skopje is:",
      "missionContent": "To facilitate the exchange of ideas, projects, and initiatives between science, education, and industry in poultry"
    },
    "images": {
      "chickenPortrait": "Poultry close-up"
    },
    "membership": {
      "title": "Membership",
      "description": "Membership in the association is voluntary.",
      "types": {
        "regular": {
          "title": "Regular",
          "description": "Any individual who is 18 years or older"
        },
        "student": {
          "title": "Student",
          "description": "Individuals enrolled in undergraduate, graduate or doctoral studies in the relevant scientific field. Student members do not pay membership fees"
        },
        "honorary": {
          "title": "Honorary",
          "description": "Individuals who have been selected by the Assembly of the Association for special merits, following a proposal by the President"
        },
        "associate": {
          "title": "Associate",
          "description": "Any legal entity that helps and supports the Association's operations"
        }
      },
      "fee": "Members pay membership fees (except student members) by April 30th each year. The amount of the membership fee is determined by the Assembly based on the President's proposal."
    },
    "leadership": {
      "title": "Leadership",
      "president": "President",
      "executiveBoard": "Executive Board",
      "executives": {
        "dodovski": {
          "firstName": "Aleksandar",
          "lastName": "Dodovski",
          "role": "President",
          "bio": {
            "p1": "Aleksandar Dodovski, PhD, MSc, DVM, is a professor at Ss. Cyril and Methodius University in Skopje, Faculty of Veterinary Medicine. With over two decades of experience in veterinary science, he specializes in avian diseases, diagnostics, and epidemiology. Throughout his career, he has advanced through various academic roles, contributing to scientific research, innovations, and veterinary education.",
            "p2": "Dr. Dodovski has authored numerous peer-reviewed publications and has played a crucial role in international projects related to avian virology and disease control. He was instrumental in the successful accreditation of advanced laboratory methods for disease diagnostics, enhancing veterinary capabilities in Macedonia. He provides expert advice to the Food and Veterinary Agency and collaborates closely with stakeholders in the agro-food sector.",
            "p3": "Passionate about advancing poultry science, he is dedicated to research, education, and fostering collaboration in the field. As President of the Macedonian Branch of the World Poultry Science Association, he continues to influence veterinary science and policy."
          }
        },
        "kotevska": {
          "firstName": "Tanja",
          "lastName": "Kotevska",
          "role": "Executive Board",
          "bio": {
            "p1": "Tanja Kotevska is a dynamic and results-driven professional with over two decades of experience spanning agricultural development, business leadership, and strategic marketing. As Development Manager at Greenagro, she spearheads educational initiatives to advance sustainable farming practices, blending modern innovation with agro-ecological principles to empower farming communities. Concurrently, she owns and operates TIV 5 DOOEL Skopje, a thriving pet service center, demonstrating entrepreneurial versatility.",
            "p2": "Her tenure at Unilever SCE as a marketing executive across South-Central Europe honed her expertise in brand strategy, cross-functional collaboration, and market trend analysis. A lifelong learner, Tanja holds certifications in leadership, project management, and psychology, complementing her Bachelor's degree in Humanities and Social Sciences. Fluent in English and adept in digital tools, she merges creative problem-solving with operational excellence to drive growth in diverse sectors—from agriculture to consumer goods—while championing sustainability, education, and community impact."
          }
        },
        "dovlev": {
          "firstName": "Aleksandar",
          "lastName": "Dovlev",
          "role": "Executive Board",
          "bio": {
            "p1": "Biography for Aleksandar Dovlev to be added."
          }
        },
        "tanevski": {
          "firstName": "Marjan",
          "lastName": "Tanevski",
          "role": "Executive Board",
          "bio": {
            "p1": "Dr. Marjan Tanevski, is a veterinarian with nineteen years of poultry industry experience. Commenced his career in 2006 at a Macedonian poultry production company as a hatchery and breeding flock manager.",
            "p2": "His responsibilities encompassed all hatchery operations, including product, personnel, and equipment management, and he ensured staff compliance with industry standards. He currently owns a Macedonian poultry hatchery dedicated to producing high-quality day-old chicks."
          }
        },
        "popchevski": {
          "firstName": "Milan",
          "lastName": "Popchevski",
          "role": "Executive Board",
          "bio": {
            "p1": "Milan Popchevski, DVM is a dedicated veterinary professional specializing in farm animal nutrition, with a focus on poultry and pigs. He graduated from the Faculty of Veterinary Medicine in Skopje in 2007.",
            "p2": "With over a decade of experience, Dr. Popchevski has worked extensively in animal nutrition, biosecurity, and farm management. From 2010 to 2013, he contributed to the establishment of HACCP procedures at the Rudine dairy factory. He then served as Director of Ravago Macedonia (2013–2023), where he provided consulting in feed, nutrition, and biosecurity. Currently, through his company VETFUD Consulting, he advises poultry, swine, and fish farms on improving animal health and performance through tailored nutritional strategies.",
            "p3": "His contributions to animal nutrition, particularly in optimizing feed supplements for improved growth performance and overall farm health, play a crucial role in advancing modern livestock management."
          }
        }
      }
    },
    "partners": {
      "title": "PARTNERS & RESOURCES",
      "description": "The Macedonian Branch of the World Poultry Science Association collaborates with numerous national and international organizations, educational institutions, and industry partners to advance poultry science in Macedonia and beyond. Below are some of our key partners and resources.",
      "wpsa": {
        "name": "World's Poultry Science Association",
        "description": "International organization dedicated to advancing poultry science globally."
      },
      "europeanFederation": {
        "name": "European Federation of WPSA Branches",
        "description": "Coordinating body for European WPSA branches."
      },
      "agenda": {
        "name": "WPSA_EF_EC_2024_Agenda_new",
        "description": "European Federation of WPSA Branches executive committee agenda document."
      },
      "mediterraneanNetwork": {
        "name": "Mediterranean Poultry Network",
        "description": "Network connecting poultry science professionals across the Mediterranean region."
      }
    },
    "contact": {
      "title": "Contact Information:",
      "address": "Address",
      "contact": "Contact us",
      "addressLines": {
        "street": "Lazar Pop Trajkov 5-7",
        "city": "1000 Skopje, Macedonia"
      },
      "email": "Email",
      "phone": "Phone"
    },
    "join": {
      "title": "Join Us",
      "description": "We welcome new members who are interested in poultry science and the poultry industry. By joining WPSA Macedonian Branch, you'll gain access to a network of professionals, educational resources, and opportunities to collaborate on research projects.",
      "button": "Learn More About Membership"
    }
  },
  "contact": {
    "title": "Contact Us",
    "mainTitle": "Send us an email, learn more!",
    "form": {
      "namePlaceholder": "Name",
      "emailPlaceholder": "E-mail",
      "messageLabel": "Message",
      "submitButton": "Submit"
    },
    "errors": {
      "emptyFields": "Please fill in all fields.",
      "invalidEmail": "Please enter a valid email address."
    },
    "success": {
      "messageSent": "Message sent successfully!"
    },
    "clipboard": {
      "success": "{{type}} copied to clipboard!",
      "error": "Could not copy: {{error}}"
    },
    "info": {
      "phone": "Phone number",
      "email": "Email",
      "clickToCopy": "Click to copy to clipboard"
    }
  },
  "joinUs": {
    "mainTitle": "Придружете ни се",
    "form": {
      "imePlaceholder": "Име",
      "prezimePlaceholder": "Презиме",
      "emailPlaceholder": "Е-пошта",
      "telefonPlaceholder": "Телефон",
      "zvanjePlaceholder": "Звање",
      "polPlaceholder": "Пол",
      "male": "Машки",
      "female": "Женски",
      "datumNaRagjanjePlaceholder": "Датум на раѓање",
      "kompanijaPlaceholder": "Компанија",
      "adresaPlaceholder": "Адреса",
      "postenskiBrojPlaceholder": "Поштенски број",
      "gradPlaceholder": "Град"
    }
  }
}
