{
  "pages": {
    "home": "почетна",
    "about": "за нас",
    "news": "вести",
    "events": "настани"
  },
  "navigation": {
    "home": "Почетна",
    "about": "За нас",
    "news": "Вести",
    "events": "Настани",
    "contact": "Контакт",
    "language": "Јазик"
  },
  "common": {
    "close": "Затвори",
    "copied": "Копирано!",
    "copyLink": "Копирај линк"
  },
  "languages": {
    "en": "Англиски",
    "mk": "Македонски"
  },
  "switchTo": "Префрли на {{lang}}",
  "events": {
    "upcomingEvents": "Претстојни настани",
    "allEvents": "Сите настани",
    "filterAll": "Сите настани",
    "filterUpcoming": "Претстојни настани",
    "filterPast": "Минати настани",
    "noEventsFound": "Не се пронајдени настани",
    "tryDifferentFilter": "Обидете се со друг филтер",
    "pastEvent": "Минат настан",
    "eventsDescription": "Откријте ги нашите сезонски активности и работилници посветени на живинарската наука",
    "readMore": "Прочитај повеќе",
    "registerNow": "Регистрирај се сега",
    "eventDetails": "Детали за настанот",
    "location": "Локација",
    "organizer": "Организатор",
    "eventDate": "Датум",
    "eventTime": "Време",
    "contactInfo": "Контакт информации",
    "joinEvent": "Придружи се",
    "applyNow": "Пријави се",
    "loadingEvent": "Вчитување на детали за настанот...",
    "learnMore": "Дознај повеќе",
    "errorLoading": "Грешка при вчитување на настаните. Ве молиме обидете се повторно подоцна."
  },
  "news": {
    "latestUpdates": "Најнови вести од светот на живинарската наука",
    "readMore": "Повеќе",
    "backToNews": "Назад кон вести",
    "backToAllNews": "Назад кон сите вести",
    "noArticlesFound": "Не се пронајдени статии",
    "tryDifferentSearch": "Обидете се со друг термин за пребарување или филтер",
    "searchPlaceholder": "Пребарај статии...",
    "allTopics": "Сите теми",
    "featured": "Истакнати вести",
    "readFullArticle": "Прочитај ја целата статија",
    "loadingArticle": "Статијата се вчитува...",
    "articleNotFound": "Статијата не е пронајдена",
    "tryAgainLater": "Ве молиме обидете се повторно подоцна или прегледајте други статии",
    "shareArticle": "Сподели ја оваа статија",
    "recentTitle": "Најнови вести",
    "recentDescription": "Бидете во тек со нашите најнови вести и случувања",
    "viewAllNews": "Погледни ги сите вести",
    "errorLoading": "Грешка при вчитување на вестите. Ве молиме обидете се повторно подоцна.",
    "filterByCategory": "Филтрирај по категорија",
    "loadError": "Неуспешно вчитување на вестите"
  },
  "post": {
    "author": "Автор",
    "published": "Објавено",
    "tags": "Тагови",
    "loading": "Статијата се вчитува...",
    "errorTitle": "Грешка при вчитување на статијата",
    "errorDefault": "Се случи грешка при вчитување на статијата.",
    "notFound": "Статијата не е пронајдена",
    "loadError": "Не успеа да се вчита статијата",
    "noIdProvided": "Не е обезбеден ID на статијата",
    "goBack": "Назад",
    "backToNews": "Назад кон вести"
  },
  "about": {
    "generalInfo": {
      "title": "ЗА ОРГАНИЗАЦИЈАТА"
    },
    "nameFirstPart": "Светско здружение за наука во живинарството - ",
    "nameFirstPartNoDashes": "Светско здружение за наука во живинарството",
    "nameSecondPart": "Македонски огранок",
    "name": "СВЕТСКО ЗДРУЖЕНИЕ ЗА НАУКА ВО ЖИВИНАРСТВОТО - МАКЕДОНСКИ ОГРАНОК",
    "nameWithoutDashes": "СВЕТСКО ЗДРУЖЕНИЕ ЗА НАУКА ВО ЖИВИНАРСТВОТО МАКЕДОНСКИ ОГРАНОК",
    "shortName": "СЗНЖ",
    "goals": {
      "title": "Цели на здружението",
      "description": "Здружението првенствено се фокусира на концептот на економски прифатлив и одржлив развој и прилагоден концепт заради заштита, унапредување и развој на науката за живинарството и живинарската индустрија. Здружението ќе ги промовира сите теоретски знаења и практични искуства кои помагаат за реализација и унапредување на основните цели и задачи.",
      "points": {
        "advancement": "Промоција на напредокот на знаењето во сите аспекти на науката за живинарството и живинарската индустрија",
        "congresses": "Промоција на Светските живинарски конгреси, како и локални и регионални собири",
        "gatherings": "Организирање на стручни и научни собири преку предавања, јавни настапи, трклаезни маси, трибини и други соодветни начини",
        "informing": "Информирање на јавноста за активностите на Здружението преку социјални мрежи и други начини",
        "projects": "Развој и имплементација на научни национални и меѓународни проекти од областа на живинарството",
        "dissemination": "Дисеминација на знаење во сите гранки на живинарската индустрија и олеснување на размената на економски активности на Здружението преку организирање на научни состаноци, семинари и предавања, како и издавачка дејност"
      }
    },
    "mission": {
      "title": "Мисија и визија",
      "visionLabel": "Визија",
      "missionLabel": "Мисија",
      "visionDeclaration": "Визијата на Здружение на граѓани Светско здружение за наука во живинарството - Македонски огранок Скопје е:",
      "visionContent": "Да биде со висока национална и меѓународна репутација и доверба промовирајќи го концептот на едно здравје",
      "missionDeclaration": "Мисијата на Здружение на граѓани Светско здружение за наука во живинарството - Македонски огранок Скопје е:",
      "missionContent": "Да ја олесни размената на идеи, проекти и иницијативи меѓу науката, образованието и индустријата во живинарството"
    },
    "images": {
      "chickenPortrait": "Живина крупен план"
    },
    "membership": {
      "title": "Членство во здружението",
      "description": "Членството во здружението е на доброволна основа.",
      "types": {
        "regular": {
          "title": "Редовно",
          "description": "Редовен член може да биде секое физичко лице со навршени 18 години живот"
        },
        "student": {
          "title": "Студентско",
          "description": "Студентски член е физичко лице кое е запишано на додипломски студии, постдипломски студии или докторски студии од соодветна научна област. Студентските членови не плаќаат чланарина"
        },
        "honorary": {
          "title": "Почесно",
          "description": "Почесен член може да биде физичко лице кое поради особени заслуги е избран од страна на Собранието на здружението, по претходен предлог на Претседателот"
        },
        "associate": {
          "title": "Придружно",
          "description": "Придружен член може да биде секое правно лице кое го помага и поддржува работењето на Здружението"
        }
      },
      "fee": "Членовите на Здружението плаќаат чланарина, освен студентските членови, најдоцна до 30.04. во тековната година. Висината на чланарината ја определува Собранието на здружението по претходен предлог од страна на Претседателот"
    },
    "leadership": {
      "title": "Раководство",
      "president": "Претседател",
      "executiveBoard": "Извршен одбор",
      "executives": {
        "dodovski": {
          "firstName": "Александар",
          "lastName": "Додовски",
          "role": "Претседател",
          "bio": {
            "p1": "Александар Додовски, PhD, MSc, DVM, е професор на Универзитетот „Св. Кирил и Методиј“ во Скопје, на Факултетот за ветеринарна медицина. Со над две децении искуство во ветеринарната наука, тој е специјализиран за болести кај птиците, дијагностика и епидемиологија. Во текот на својата кариера, тој напредувал низ различни академски улоги, придонесувајќи за научни истражувања, иновации и ветеринарно образование.",
            "p2": "Д-р Додовски е автор на бројни рецензирани публикации и има клучна улога во меѓународни проекти поврзани со вирологијата кај птиците и контролата на болести. Тој беше клучен во успешната акредитација на напредни лабораториски методи за дијагностика на болести, подобрувајќи ги ветеринарните капацитети во Македонија. Тој дава стручни совети на Агенцијата за храна и ветеринарство и тесно соработува со засегнатите страни во агро-прехранбениот сектор.",
            "p3": "Страстен за унапредување на науката за живинарството, тој е посветен на истражување, образование и поттикнување соработка во областа. Како Претседател на Македонскиот огранок на Светското здружение за наука во живинарството, тој продолжува да влијае врз ветеринарната наука и политика."
          }
        },
        "kotevska": {
          "firstName": "Тања",
          "lastName": "Котевска",
          "role": "Извршен одбор",
          "bio": {
            "p1": "Тања Котевска е динамичен професионалец ориентиран кон резултати со над две децении искуство во земјоделски развој, бизнис лидерство и стратешки маркетинг. Како менаџер за развој во Гринагро, таа води едукативни иницијативи за унапредување на одржливи земјоделски практики, комбинирајќи модерни иновации со агро-eколошки принципи за зајакнување на земјоделските заедници. Истовремено, таа поседува и управува со ТИВ 5 ДООЕЛ Скопје, успешен центар за услуги за миленици, покажувајќи претприемачка разновидност.",
            "p2": "Нејзиниот ангажман во Унилевер СЦЕ како маркетинг извршен директор низ Југоисточна Европа ја усоврши нејзината експертиза во стратегија на брендови, меѓуфункционална соработка и анализа на пазарните трендови. Како доживотен ученик, Тања поседува сертификати за лидерство, управување со проекти и психологија, кои го надополнуваат нејзиниот бакалауреат по хуманистички и општествени науки. Течно зборува англиски и вешта е со дигитални алатки, таа го спојува креативното решавање проблеми со оперативната извонредност за да поттикне раст во различни сектори - од земјоделство до стоки за широка потрошувачка - истовремено залагајќи се за одржливост, образование и влијание врз заедницата."
          }
        },
        "dovlev": {
          "firstName": "Александар",
          "lastName": "Довлев",
          "role": "Извршен одбор",
          "bio": {
            "p1": "Биографијата за Александар Довлев ќе биде додадена."
          }
        },
        "tanevski": {
          "firstName": "Марјан",
          "lastName": "Таневски",
          "role": "Извршен одбор",
          "bio": {
            "p1": "Д-р Марјан Таневски е ветеринар со деветнаесетгодишно искуство во живинарската индустрија. Кариерата ја започнал во 2006 година во македонска компанија за производство на живина како менаџер на инкубаторска станица и одгледувалиште.",
            "p2": "Неговите одговорности ги опфаќаа сите операции во инкубаторската станица, вклучувајќи управување со производи, персонал и опрема, и тој обезбедуваше усогласеност на персоналот со индустриските стандарди. Моментално поседува македонска инкубаторска станица за живина посветена на производство на висококвалитетни еднодневни пилиња."
          }
        },
        "popchevski": {
          "firstName": "Милан",
          "lastName": "Попчевски",
          "role": "Извршен одбор",
          "bio": {
            "p1": "Милан Попчевски, ДВМ е посветен ветеринарен професионалец специјализиран за исхрана на фармски животни, со фокус на живина и свињи. Дипломирал на Факултетот за ветеринарна медицина во Скопје во 2007 година.",
            "p2": "Со над десетгодишно искуство, д-р Попчевски има работено опширно во областа на исхраната на животните, биосигурноста и управувањето со фарми. Од 2010 до 2013 година, тој придонел за воспоставување на HACCP процедури во млекарата Рудине. Потоа работел како Директор на Раваго Македонија (2013–2023), каде што обезбедувал консултации за храна за животни, исхрана и биосигурност. Моментално, преку својата компанија ВЕТФУД Консалтинг, тој советува фарми за живина, свињи и риби за подобрување на здравјето и перформансите на животните преку прилагодени нутриционистички стратегии.",
            "p3": "Неговите придонеси во исхраната на животните, особено во оптимизирање на додатоците во храната за подобрен раст и целокупно здравје на фармата, играат клучна улога во унапредувањето на современото управување со сточарството."
          }
        }
      }
    },
    "partners": {
      "title": "ПАРТНЕРИ И РЕСУРСИ",
      "description": "Македонскиот огранок на организацијата соработува со бројни национални и меѓународни организации, образовни институции и индустриски партнери за унапредување на науката за живинарството во Македонија и пошироко. Подолу се некои од нашите клучни партнери и ресурси.",
      "wpsa": {
        "name": "Светско здружение за наука во живинарството",
        "description": "Меѓународна организација посветена на унапредување на науката за живинарството глобално."
      },
      "europeanFederation": {
        "name": "Европска федерация на огранци на СЗНЖ",
        "description": "Координационо тело за европските огранци на СЗНЖ."
      },
      "agenda": {
        "name": "WPSA_EF_EC_2024_Agenda_new",
        "description": "Документ за агенда на извршниот комитет на Европската федерация на огранци на СЗНЖ."
      },
      "mediterraneanNetwork": {
        "name": "Медитеранска мрежа за живинарство",
        "description": "Мрежа што ги поврзува професионалците од областа на науката за живинарството низ медитеранскиот регион."
      }
    },
    "contact": {
      "title": "Контакт информации:",
      "address": "Адреса",
      "contact": "Контакт",
      "addressLines": {
        "street": "Лазар Поп Трајков 5-7",
        "city": "1000 Скопје, Македонија"
      },
      "email": "Е-пошта",
      "phone": "Телефон"
    },
    "join": {
      "title": "Придружете се",
      "description": "Добредојдени се нови членови кои се заинтересирани за науката во живинарството и живинарската индустрија. Со приклучување кон СЗНЖ Македонски огранок, ќе добиете пристап до мрежа на професионалци, образовни ресурси и можности за соработка на истражувачки проекти.",
      "button": "Дознајте повеќе за членството"
    }
  },
  "contact": {
    "title": "Контактирајте не",
    "mainTitle": "Испрати ни мејл, дознај повеќе!",
    "form": {
      "namePlaceholder": "Име",
      "emailPlaceholder": "Е-пошта",
      "messageLabel": "Порака",
      "submitButton": "Испрати"
    },
    "errors": {
      "emptyFields": "Ве молиме пополнете ги сите полиња.",
      "invalidEmail": "Ве молиме внесете валидна адреса за е-пошта."
    },
    "success": {
      "messageSent": "Пораката е успешно испратена!"
    },
    "clipboard": {
      "success": "{{type}} е копиран во клипборд!",
      "error": "Не може да се копира: {{error}}"
    },
    "info": {
      "phone": "Телефонски број",
      "email": "Е-пошта",
      "clickToCopy": "Кликнете за копирање"
    }
  },
  "joinUs": {
    "mainTitle": "Придружете ни се",
    "form": {
      "imePlaceholder": "Име",
      "prezimePlaceholder": "Презиме",
      "emailPlaceholder": "Е-пошта",
      "telefonPlaceholder": "Телефон",
      "zvanjePlaceholder": "Звање",
      "polPlaceholder": "Пол",
      "male": "Машки",
      "female": "Женски",
      "datumNaRagjanjePlaceholder": "Датум на раѓање",
      "kompanijaPlaceholder": "Компанија",
      "adresaPlaceholder": "Адреса",
      "postenskiBrojPlaceholder": "Поштенски број",
      "gradPlaceholder": "Град"
    }
  }
}
